{"contents":{"0":{"cells":{"0":{"id":1,"image":"https://res.cloudinary.com/hcw10/image/upload/v1406726724/10_1/image1.png","number":1,"text":"All atoms are made up of positively charged particles called <span class=\"glossary\">protons</span> at the center, or nucleus, of the atom, and the cloud of negatively charged <span class=\"glossary\"></span><span class=\"glossary\"></span><span class=\"glossary\">electrons</span> that surro<span class=\"glossary\"></span>und the nucleus. (The nucleus also contains <span class=\"glossary\">neutrons</span>, particles that have mass but no electrical charge.) Each type of charged particle repels similarly charged particles and attracts particles with the opposite charge.","type":"step"},"1":{"id":2,"number":2,"text":"In some atoms, such as copper and aluminum, the attraction is weak between the protons and the electrons in the atoms’ outermost layer. In such <span class='glossary'>conductive</span> materials, electrons jump freely from one atom to another under the right circumstances. This movement of electrons is <span class='glossary'>electricity</span>. In other materials, such as rubber and glass, electrons are more closely bound to their nuclei and do not easily move from one atom to another. These <span class='glossary'>nonconductive</span> materials are <span class='glossary'>insulators</span>. Still other materials, such as silicon, can act as either conductors or nonconductors under different conditions. These are <span class='glossary'>semiconductors</span>, an important component of microchips and transistors.","type":"step"},"2":{"id":3,"image":"https://res.cloudinary.com/hcw10/image/upload/v1406732326/10_1/Test.svg","number":3,"text":"When electricity is moving through a wire, it creates an electromagnetic field that surrounds the wire. <span class='glossary'>Electromagnetism</span> is a form of energy that spreads in the form of waves. Light, radio signals, microwaves, television signals, and heat are examples of electromagnetism.","type":"step"},"3":{"id":4,"image":"https://res.cloudinary.com/hcw10/image/upload/v1406729407/10_1/TestAsPNG.png","number":4,"text":"All electrical devices invariably create stray, unwanted electromagnetic fields called noise. Static on the radio and snow on a television screen are tangible examples of electrical noise. Much of the electromechanical design of computer components, such as adding nonfunctioning wires to cables, is aimed at reducing the interference of noise. The noisier the environment, the stronger a signal must be to make itself heard over the noise. And the stronger a signal, the more noise it creates that affect other components.","type":"step"},"4":{"id":5,"image":"images/page156/image4.png","number":5,"text":"Conversely, when a wire moves through a magnetic field, the interaction creates an electrical current in the wire. AC electrical current is produced by generators that are essentially giant coils of wire spinning through a field created by massive magnets.","type":"step"},"5":{"id":6,"image":"images/page156/image5.png","number":6,"text":"Similarly, electromagnetic fields are influenced by the presence, proximity, shape, composition, and mass of objects moving through the field. Those changes to the frequency or amplitude of an EM field can be detected and are the basis for metal detectors, radio receivers, and the capability of a computer drive’s read/write heads to detect how particles on the disk are arranged magnetically to represent data.","type":"step"},"6":{"id":"6b","image":"images/page156/image6.png","number":"","text":"","type":"image"},"7":{"id":7,"number":7,"text":"The entire realm of electromagnetic field energy is called the electromagnetic radiation spectrum, which includes the complete range of energy, beginning with the longest radio waves, through visible light—a very small part of the spectrum—to the extremely short gamma rays produced by radioactive atoms and major astronomical events, such as novas.","type":"step"},"8":{"id":8,"number":8,"text":"All EM fields expand at the rate of 186,000 miles a second, the speed of light. Electromagnetic fields are measured in terms of the frequency of the waves they produce, using the hertz (Hz). A frequency of 1,000 waves a second is 1 kilohertz (kHz). In the case of infrared, visible light, ultraviolet, and gamma radiation, the wavelength is more often specified in nanometers (units of 10-9 meter) or Angstrom units (units of 10-10 meter).","type":"step"},"9":{"id":9,"image":"images/page156/image7.jpg","number":9,"text":"The frequency of an EM field is inversely related to its wavelength, the distance between identical points in adjacent waves. The higher the frequency of the signal, the shorter the wavelength. A signal at 100MHz—in the middle of the FM radio broadcast band—has a wavelength of about 10 feet. A signal at 30 gigahertz (GHz)—in the range of radar and microwaves—has a wavelength of a little less than half an inch.","type":"step"},"10":{"id":10,"image":"images/page156/image8.png","number":10,"text":"Electromagnetic fields are used as signals to carry data by creating variations in the waveform.<br/><span class='glossary'>Frequency modulation</span> (FM) carries data by varying the frequency of a fundamental <span class='glossary'>waveform</span>.<br/><span class='glossary'>Amplitude modulation</span> (AM) varies the strength, or amplitude, of a basic waveform. The amount of data that a signal can carry increases with the frequency of the electromagnetic field creating them. Because there are more variations in one second of higher frequency waves, there are more opportunities to modulate the wave so that it carries data.","type":"step"}},"chapter":10,"id":"10_1","number":1,"title":"How Electromagnetism Reacts with Matter"},"1":{"cells":{"0":{"id":1,"number":1,"text":"When you click your mouse to save a file, the program you’re using sends a command to Windows, asking the operating system to carry out the steps needed to save the file from RAM, where it’s being held temporarily, to disk for permanent storage. For this example, we’ll assume you’re using a word processor to save a file named Letter to Mom.doc.","type":"step"},"1":{"id":2,"number":2,"text":"Windows modifies the record of the folder (directory) structure stored in the virtual file allocation table, or VFAT (simply FAT in DOS or FAT32 in Windows 98), to indicate that a file named Letter to Mom.doc will be stored in the current folder, or in another folder if you provide a different directory path. There is no FAT in Windows NT, 2000, and XP. Location information for each cluster in a file is saved in every cluster that helps make up the file.","type":"step"},"2":{"id":3,"number":3,"text":"The operating system also checks the VFAT for the number of a cluster where the VFAT says Windows can save the file without overwriting any other data that’s already been saved. In this example, the VFAT tells Windows that Cluster 3 is available to record data.","type":"step"},"3":{"id":4,"number":4,"text":"From the VFAT, the operating system also determines that the location of Cluster 3 comprises Sectors 2, 3, 4, and 5 on Track 1. Windows sends this information to the PC’s <span class='glossary'>BIOS (basic input/output system)</span>.","type":"step"},"4":{"id":5,"number":5,"text":"The BIOS frees the software and operating system from the details of saving the file. It retrieves the data that will make up Letter to Mom.doc from where the word processor is using it in RAM. At the same time, it issues the instructions to the disk drive controller to save the data that the BIOS is sending it, beginning at Sectors 2 through 5 on Track 1.","type":"step"},"5":{"id":6,"number":6,"text":"If the file is larger than the number of bytes contained in a single cluster, the operating system asks the VFAT for the location of another cluster in which it can continue saving the file. The clusters need not be adjacent to each other on the disk. The VFAT maintains a record of the chain of clusters over which the file is spread. The process of moving data from RAM to disks repeats itself until the operating system encounters a special code called an <span class='glossary'>end-of-file marker</span>.","type":"step"},"6":{"id":7,"number":7,"text":"Finally, Windows or DOS changes the information contained in the VFAT to mark which clusters contain Letter to Mom.doc, so that later the operating system will know the clusters are already in use and won’t overwrite Mom’s letter.","type":"step"},"7":{"id":"call1","image":"https://res.cloudinary.com/hcw10/image/upload/v1406823444/10_4/callout1.jpg","text":"When you delete a file, the data that makes up the file is not actually changed on the disk. Instead, the operating system changes the information in the VFAT to indicate that the clusters that had been used by that file are now available for reuse by other files. Because the data remains on disk until the clusters are reused, you often can restore—or undelete—a file that you’ve accidentally erased.","title":"What Happens When You Delete a File?","type":"callout"}},"chapter":10,"id":"10_4","number":2,"title":"How a PC Saves a File to Disk"},"10_5":{"cells":{"1":{"id":1,"number":"1","text":"In this step, I will begin by starting.","type":"step",".priority":1},"2":{"id":2,"number":"2","text":"This is step two.","type":"step",".priority":0}},"chapter":"10","id":"10_5","number":"5","title":"New Spread"},"2_1":{"cells":{"1":{"id":1,"number":"1","text":"A small, positive electrical charge is sent down one aluminum lead that runs into the transistor. The positive\ncharge spreads to a layer of electrically conductive polysilicon buried in the middle of nonconductive silicon\ndioxide. Silicon dioxide is the main component of sand and the material that gave Silicon Valley its name.","type":"step"},"2":{"id":2,"number":"2","text":"The positive charge attracts negatively charged electrons from the base made of P-type (positive)\nsilicon that separates two layers of N-type (negative) silicon.","type":"step"},"3":{"id":3,"number":"3","text":"The rush of electrons out of the P-type silicon creates an electronic vacuum that is filled by electrons rushing from another\nconductive lead called the source. In addition to filling the vacuum in the P-type silicon, the electrons from the source also\nflow to a similar conductive lead called the drain. The rush of electrons completes the circuit, turning on the transistor so\nthat it represents 1 bit. If a negative charge is applied to the polysilicon, electrons from the source are repelled and the\ntransistor is turned off.","type":"step"},"4":{"id":"callout1","text":"Thousands of transistors are connected on a single\nslice of silicon. The slice is embedded in a piece of\nplastic or ceramic material and the ends of the circuitry\nare attached to metal leads that expand to connect\nthe chip to other parts of a computer circuit\nboard. The leads carry signals into the chip and send\nsignals from the chip to other computer components.","title":"Creating a Chip from Transistors","type":"callout"}},"chapter":"2","id":"2_1","number":"1","title":"How a Little Transistor Does Big Jobs"}},"layouts":{"0":{"hints":{"0":{"id":"1","image":"BL","width":0.5},"1":{"id":"2","width":0.5},"2":{"id":"3","image":"TR","marginTop":"-40","width":1},"3":{"id":4,"image":"L","width":1},"4":{"id":5,"image":"BL","width":".4"},"5":{"id":6,"image":"TR","marginTop":-50,"width":0.6},"6":{"id":"6b","width":"1"},"7":{"id":7,"width":0.5},"8":{"id":8,"width":0.5},"10":{"id":9,"image":"R","width":1},"11":{"id":10,"image":"L","width":1}},"id":"10_1","style":"grid"},"1":{"background":"https://res.cloudinary.com/hcw10/image/upload/v1406731052/10_4/page162.jpg","hints":{"0":{"anchor":"BR","bounds":{"0":50,"1":62,"2":182,"3":237},"id":1},"1":{"anchor":"BR","bounds":{"0":308,"1":92,"2":179,"3":235},"id":2},"2":{"anchor":"BR","bounds":{"0":668,"1":100,"2":250,"3":160},"id":3},"3":{"anchor":"TL","bounds":{"0":1111,"1":280,"2":260,"3":108},"id":4},"4":{"anchor":"R","bounds":{"0":1120,"1":641,"2":258,"3":150},"id":5},"5":{"anchor":"L","bounds":{"0":744,"1":649,"2":360,"3":142},"id":6},"6":{"anchor":"TR","bounds":{"0":178,"1":545,"2":260,"3":120},"id":7},"7":{"anchor":"BL","backgroundColor":"#e0d988","bounds":{"0":16,"1":470,"2":325,"3":275},"id":"call1","theme":"factoid"}},"id":"10_4","style":"fixed"},"10_5":{"hints":{"1":{"id":"1","width":1},"2":{"id":"2","width":1}},"id":"10_5","style":"grid"},"2_1":{"hints":{"1":{"id":1,"width":1},"2":{"id":2,"width":1},"3":{"id":3,"width":1},"4":{"id":"callout1","theme":"factoid","width":0.3}},"id":"2_1","style":"grid"}}}